
Функция ClinicReportGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderStatusPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderByIdGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrdersGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция ServicesGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrdersPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция PatientsGET(Запрос)
	Попытка
		
		ИД = Запрос.ПараметрыURL["id"];
		Пациент = Справочники.Пациенты.НайтиПоКоду(ИД);
		Если Пациент.Пустая() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пациент не найден");
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("id",        Пациент.Код);
		Данные.Вставить("name",      Пациент.Наименование);
		Данные.Вставить("birthdate", Формат(Пациент.ДатаРождения, "ДФ=yyyy-MM-dd"));
		Данные.Вставить("gender",    Строка(Пациент.Пол));
		Данные.Вставить("phone",     Пациент.Телефон);
		Данные.Вставить("policy",    Пациент.ПолисОМС);
		Данные.Вставить("clinic",    Строка(Пациент.Клиника));
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
	Исключение
		Возврат ОтветОшибки(500,"internal_error" , ОписаниеОшибки());
	КонецПопытки;
	
			
КонецФункции

Функция ВСтрокуJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ОтветОшибки(КодHTTP, КодОшибки, Сообщение)
	Данные = Новый Структура;
	Данные.Вставить("error", КодОшибки);
	Данные.Вставить("message", Сообщение);
	
	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
	Возврат Ответ;
		
КонецФункции


