
Функция ClinicReportGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderStatusPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderByIdGET(Запрос)
	
	Попытка
		ИД = Запрос.ПараметрыURL["id"];
		Заказ = Документы.ЗаказУслуги.НайтиПоНомеру(ИД);
		Если Заказ.Пустая() Тогда
    		Возврат ОтветОшибки(404, "not_found", "Заказ не найден");
		КонецЕсли;
		
		Услуги = Новый Массив;
		Для каждого Стр из Заказ.Услуги Цикл
			Эл = Новый Структура;
			Эл.Вставить("name",     Строка(Стр.Услуга));
		    Эл.Вставить("quantity", Стр.Количество);
		    Эл.Вставить("price",    Стр.Цена);
		    Эл.Вставить("sum",      Стр.Сумма);
		    Услуги.Добавить(Эл);
		КонецЦикла;
		
		Данные = Новый Структура;
		Данные.Вставить("id",       Заказ.Номер);
		Данные.Вставить("date",     Формат(Заказ.Дата, "ДФ=yyyy-MM-dd"));
		Данные.Вставить("patient",  Строка(Заказ.Пациент));
		Данные.Вставить("clinic",   Строка(Заказ.Клиника));
		Данные.Вставить("status",   Строка(Заказ.Статус));
		Данные.Вставить("comment",  Заказ.Комментарий);
		Данные.Вставить("services", Услуги);
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
		
	Исключение
		Ответ = ОтветОшибки(500, "internal_error" , ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
		
		
		
	
КонецФункции

Функция OrdersGET(Запрос)
	

	
		
	
КонецФункции

Функция ServicesGET(Запрос)
	
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Услуги.Код КАК Код,
		|	Услуги.Наименование КАК Наименование,
		|	Услуги.БазоваяЦена КАК БазоваяЦена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.ПометкаУдаления = ЛОЖЬ";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Список = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Элемент = Новый Структура;
			Элемент.Вставить("id", Выборка.Код);
			Элемент.Вставить("name", Выборка.Наименование);
			Элемент.Вставить("price", Выборка.БазоваяЦена);
			Элемент.Вставить("duration", Выборка.Длительность);
			Список.Добавить(Элемент);
			
		КонецЦикла;
					
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Список));
		Возврат Ответ;
		
	Исключение
		Возврат ОтветОшибки(500,"internal_error" , ОписаниеОшибки());
	КонецПопытки;
	
		
	
КонецФункции

Функция OrdersPOST(Запрос)
	НачатьТранзакцию();
	Попытка
	
		СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Данные = ПрочитатьJSON(ЧтениеJSON);
			
		Клиника = Справочники.Клиники.НайтиПоКоду(Данные.clinic);
		Пациент = Справочники.Пациенты.НайтиПоКоду(Данные.patient);
		Услуга  = Справочники.Услуги.НайтиПоКоду(Данные.service);
		
		Если Клиника.Пустая() Тогда
		    ОтменитьТранзакцию();
		    Возврат ОтветОшибки(400, "not_found", "Клиника не найдена");
		КонецЕсли;
		Если Пациент.Пустая() Тогда
		    ОтменитьТранзакцию();
		    Возврат ОтветОшибки(400, "not_found", "Пациент не найден");
		КонецЕсли;
		Если Услуга.Пустая() Тогда
		    ОтменитьТранзакцию();
		    Возврат ОтветОшибки(400, "not_found", "Услуга не найдена");
		КонецЕсли;
			
		ДокЗаказ = Документы.ЗаказУслуги.СоздатьДокумент();
		ДокЗаказ.Дата      = ТекущаяДата();
		ДокЗаказ.Клиника   = Клиника;
		ДокЗаказ.Пациент   = Пациент;
		ДокЗаказ.Статус    = Перечисления.СтатусыЗаказа.Новый;
		ДокЗаказ.Комментарий = Данные.comment;
		
		СтрТЧ = ДокЗаказ.Услуги.Добавить();
		СтрТЧ.Услуга     = Услуга;
		СтрТЧ.Количество = Данные.quantity;
		СтрТЧ.Цена       = Услуга.БазоваяЦена;
		СтрТЧ.Сумма      = СтрТЧ.Количество * СтрТЧ.Цена;
	
	
	    ДокЗаказ.Записать(РежимЗаписиДокумента.Запись);
	    ЗафиксироватьТранзакцию();
	    
	    Результат = Новый Структура;
		Результат.Вставить("status",   "created");
		Результат.Вставить("id",       ДокЗаказ.Номер);
		Результат.Вставить("document", Строка(ДокЗаказ));
		
		Ответ = Новый HTTPСервисОтвет(201);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Результат));
		Возврат Ответ;
	Исключение
    	ОтменитьТранзакцию();
    	Возврат ОтветОшибки(500, "write_error", ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Функция PatientsGET(Запрос)
	Попытка
		
		ИД = Запрос.ПараметрыURL["id"];
		Пациент = Справочники.Пациенты.НайтиПоКоду(ИД);
		Если Пациент.Пустая() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пациент не найден");
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("id",        Пациент.Код);
		Данные.Вставить("name",      Пациент.Наименование);
		Данные.Вставить("birthdate", Формат(Пациент.ДатаРождения, "ДФ=yyyy-MM-dd"));
		Данные.Вставить("gender",    Строка(Пациент.Пол));
		Данные.Вставить("phone",     Пациент.Телефон);
		Данные.Вставить("policy",    Пациент.ПолисОМС);
		Данные.Вставить("clinic",    Строка(Пациент.Клиника));
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
	Исключение
		Возврат ОтветОшибки(500,"internal_error" , ОписаниеОшибки());
	КонецПопытки;
	
			
КонецФункции

Функция ВСтрокуJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ОтветОшибки(КодHTTP, КодОшибки, Сообщение)
	Данные = Новый Структура;
	Данные.Вставить("error", КодОшибки);
	Данные.Вставить("message", Сообщение);
	
	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
	Возврат Ответ;
		
КонецФункции


